; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	infrared0 - mode
	thermograph1 - mode
	GroundStation0 - direction
	Star2 - direction
	Star3 - direction
	GroundStation5 - direction
	Star6 - direction
	GroundStation7 - direction
	Star4 - direction
	Star1 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Planet15 - direction
	Star16 - direction
	Phenomenon17 - direction
	Phenomenon18 - direction
	Phenomenon19 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star1)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star10)
)
(:goal (and
	(have_image Planet8 infrared0)
	(have_image Phenomenon9 infrared0)
	(have_image Star10 infrared0)
	(have_image Phenomenon11 infrared0)
	(have_image Star12 infrared0)
	(have_image Phenomenon13 thermograph1)
	(have_image Star14 infrared0)
	(have_image Planet15 infrared0)
	(have_image Star16 thermograph1)
	(have_image Phenomenon17 thermograph1)
	(have_image Phenomenon18 thermograph1)
	(have_image Phenomenon19 thermograph1)
))

)

; plan
1. (turn_to satellite0 star1 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star1)
   goals met: 0 of 12
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 12
3. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 0 of 12
4. (turn_to satellite0 phenomenon19 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon19)
   goals met: 0 of 12
5. (take_image satellite0 phenomenon19 instrument0 thermograph1)
   added: (have_image phenomenon19 thermograph1)
   goals met: 1 of 12
6. (turn_to satellite0 phenomenon18 phenomenon19)
   deleted: (pointing satellite0 phenomenon19)
   added: (pointing satellite0 phenomenon18)
   goals met: 1 of 12
7. (take_image satellite0 phenomenon18 instrument0 thermograph1)
   added: (have_image phenomenon18 thermograph1)
   goals met: 2 of 12
8. (turn_to satellite0 phenomenon17 phenomenon18)
   deleted: (pointing satellite0 phenomenon18)
   added: (pointing satellite0 phenomenon17)
   goals met: 2 of 12
9. (take_image satellite0 phenomenon17 instrument0 thermograph1)
   added: (have_image phenomenon17 thermograph1)
   goals met: 3 of 12
10. (turn_to satellite0 phenomenon13 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 phenomenon13)
   goals met: 3 of 12
11. (take_image satellite0 phenomenon13 instrument0 thermograph1)
   added: (have_image phenomenon13 thermograph1)
   goals met: 4 of 12
12. (turn_to satellite0 phenomenon11 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon11)
   goals met: 4 of 12
13. (take_image satellite0 phenomenon11 instrument0 infrared0)
   added: (have_image phenomenon11 infrared0)
   goals met: 5 of 12
14. (turn_to satellite0 phenomenon9 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon9)
   goals met: 5 of 12
15. (take_image satellite0 phenomenon9 instrument0 infrared0)
   added: (have_image phenomenon9 infrared0)
   goals met: 6 of 12
16. (turn_to satellite0 planet15 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet15)
   goals met: 6 of 12
17. (take_image satellite0 planet15 instrument0 infrared0)
   added: (have_image planet15 infrared0)
   goals met: 7 of 12
18. (turn_to satellite0 planet8 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 planet8)
   goals met: 7 of 12
19. (take_image satellite0 planet8 instrument0 infrared0)
   added: (have_image planet8 infrared0)
   goals met: 8 of 12
20. (turn_to satellite0 star10 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star10)
   goals met: 8 of 12
21. (take_image satellite0 star10 instrument0 infrared0)
   added: (have_image star10 infrared0)
   goals met: 9 of 12
22. (turn_to satellite0 star12 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star12)
   goals met: 9 of 12
23. (take_image satellite0 star12 instrument0 infrared0)
   added: (have_image star12 infrared0)
   goals met: 10 of 12
24. (turn_to satellite0 star14 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star14)
   goals met: 10 of 12
25. (take_image satellite0 star14 instrument0 infrared0)
   added: (have_image star14 infrared0)
   goals met: 11 of 12
26. (turn_to satellite0 star16 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star16)
   goals met: 11 of 12
27. (take_image satellite0 star16 instrument0 thermograph1)
   added: (have_image star16 thermograph1)
   goals met: 12 of 12
